InformationRegisters/DeleteEDExchangeMembersThroughEDFOperators.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>DeleteEDExchangeMembersThroughEDFOperators</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>EMail_Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDFScheduleVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Exchange1CRegulationsVersion</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StatusModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMemberStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDExchangeFilesFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeFileFormats</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>AgreementAboutEDUsage</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Participant</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Exchange1CRegulationsVersion.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>Exchange1CRegulationsVersion</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Version10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Version20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/DeleteEDExchangeMembersThroughEDFOperators/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

////////////////////////////////////////////////////////////////////////////////
// Info base update

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Handler of the update BED 1.0.5.0
// Filling regulations version in agreements.
//
Procedure UpdateEDEScheduleVersion() Export
	
	RecordSet = InformationRegisters.DeleteEDExchangeMembersThroughEDFOperators.CreateRecordSet();
	RecordSet.Read();
	
	For Each Record IN RecordSet Do
		If Not ValueIsFilled(Record.EDFScheduleVersion) Then
			Record.EDFScheduleVersion = Enums.Exchange1CRegulationsVersion.Version10;
		EndIf;
	EndDo;
	
	InfobaseUpdate.WriteData(RecordSet)
	
EndProcedure

// Handler of the update BED 1.1.13.2
// Replaces regulations version to 2.0, as 1.0 is not supported any more.
//
Procedure ReplaceFrom1On2RegulationsVersionEDF() Export
	
	RecordSet = InformationRegisters.DeleteEDExchangeMembersThroughEDFOperators.CreateRecordSet();
	RecordSet.Read();
	
	For Each Record IN RecordSet Do
		If Record.EDFScheduleVersion = Enums.Exchange1CRegulationsVersion.Version10 Then
			Record.EDFScheduleVersion = Enums.Exchange1CRegulationsVersion.Version20;
		EndIf;
	EndDo;
	
	InfobaseUpdate.WriteData(RecordSet)
	
EndProcedure

#EndIf
